Repository: 2moveit/framework
Catalog: Signum.Entities/Properties/Resources.*.resx
Languages: de, es, fr, pt

source: ({0} as {1})
de: ({0} als {1})
es: ({0} como {1})
fr: ({0} comme {1})
pt: ({0} como {1})

source: {{0}} does not have a valid {0} format
de: {{0}} hat nicht eine gültige {0}-Format
es: {{0}} no tiene formato de {0} correcto
fr: {{0}} n'a pas un format {0} valide
pt: {{0}} não tem um formato válido {0}

# _0DoesNotInheritFromIdentifiableEntity
source: {0} is not a sublass of IdentifiableEntity
es: {0} no hereda de IdentifiableEntity
fr: {0} n'est pas une sous-classe d'entité identifiable

source: {0} has hours, minutes and seconds
es: {0} tiene horas minutos y segundos
fr: {0} a des heures, minutes et secondes

source: {{0}} has more than {0} decimal places
de: {{0}} hat mehr als {0} Dezimalstellen
es: {{0}} tiene mas de {0} decimales
fr: {{0}} a plus {0} places décimales
pt: {{0}} possui mais de {0} casas decimais

source: {0} has no correct format
de: {0} hat keine richtigen format
es: {0} no tiene el formato correcto
fr: {0} n'a pas un format correct
pt: {0} não tem o formato correcto

source: {{0}} has some repeated elements: {0}
de: {{0}} hat einige wiederholte Elemente: {0}
es: {{0}} tiene algunos elementos repetidos: {0}
fr: {{0}} contient des répétitions: {0}
pt: {{0}} tem alguns elementos repetidos: {0}

# _0HasToBe0Than1
source: {{0}} has to be {0} {1}
de: {{0}} hat {0} {1} sein
es: {{0}} ha de ser {0} {1}
fr: {{0}} doit être {0} {1}
pt: {{0}} deve ser {0} que {1}

source: {{0}} Has to be between {0} and {1}
de: {{0}} muss zwischen {0} und {1}
es: {{0}} debe estar entre {0} y {1}
fr: {{0}} Doit être entre {0} et {1}
pt: {{0}} deve estar entre {0} e {1}

source: {0} has to be lowercase
de: {0} muss Kleinbuchstaben sein
es: {0} debe estar todo en minúsculas
fr: {0} doit être en minuscule
pt: {0} deve ser em minúsculas

source: {0} has to be uppercase
de: {0} muss in Großbuchstaben geschrieben werden
es: {0} debe estar todo en mayúsculas
fr: {0} doit être en majuscule
pt: {0} deve ser em maiúsculas

source: {0} is necessary on state {1}
de: {0} ist notwendig auf Status {1}
es: {0} es necesario en estado {1}
fr: {0} est nécessaire en état {1}
pt: {0} é necessário no estado {1}

source: '{0}' is New and has no id
es: '{0}' es nueva y no tiene Id
fr: '{0}' est nouveau et n'a pas d'id

source: {0} is not allowed on state {1}
de: {0} ist auf Status {1} nicht zulässig
es: {0} no está permitido en estado {1}
fr: {0} n'est pas permis en état {1}
pt: {0} não é permitido no estado {1}

source: {0} not supported
es: {0} no soportado
fr: {0} pas supporté

source: and
de: und
es: y
fr: et
pt: e

source: Attempt to modify {0} when the entity is not new
es: Se ha intentado modificar {0} cuando la entidad no es nueva
fr: Tentative de modifier {0} quand l'entité n'est pas nouvelle

source: Attempt to save a not new modified ImmutableEntity
es: Se ha intentado guardad una ImmutableEntity modificada y no nueva
fr: Tentative de sauver une ancienne entité inchangeable

source: be
de: werden
es: ser
fr: être
pt: ser

source: be between {0} and {1}
de: zwischen Sie {0} und {1}
es: estar entre {0} y {1}
fr: Doit être entre {0} et {1}
pt: estar entre {0} e {1}

source: be not null
de: nicht null sein
es: ser no nulo
fr: doit être non nul
pt: não pode ser nula

# ComparisonType_DistinctTo
source: distinct to
de: anders als
es: distinto a
fr: distinctes de
pt: diferente de

# ComparisonType_EqualTo
source: equal to
de: gleich
es: igual a
fr: Egale à
pt: igual a

# ComparisonType_GreaterThan
source: greater than
de: größer als
es: mayor que
fr: Plus grande que
pt: maior que

# ComparisonType_GreaterThanOrEqual
source: greater than or equal
de: größer als oder gleich
es: mayor o igual que
fr: Plus grand que ou égal
pt: maior ou igual a

# ComparisonType_LessThan
source: less than
de: weniger als
es: menor que
fr: Plus petit que
pt: menor que

# ComparisonType_LessThanOrEqual
source: less than or equal
de: kleiner oder gleich
es: menor o igual que
fr: Plus petit que ou égal
pt: menor ou igual a

source: [Count]
de: Num
es: [Num]
fr: [Compte]
pt: Contagem

source: Day
de: Tag
es: Dia
fr: Jour
pt: Dia

# DifferentInstancesOfTheSameEntity1HaveBeenFound2
source: {0} Different instances of the same entity ({1}) have been found: {2}
es: Se han encontrado {0} instancias diferentes de la misma entidad ({1}): {2}
fr: {0}Des instances différentes de l'entité ({1}) ont été trouvées: {2}

# EntitiesDoNotMatch
source: Entity do not Match with the Lite
es: La entidad no coincide con el Lite
fr: L'entité ne correspond pas avec le Lite

# FieldForPropertyNotFound
source: Field not found for property {0}
es: No se ha encontrado el campo correspondiente para la propiedad {0}
fr: Champ introuvable pour la propriété {0}

source: file name
de: Dateiname
es: Nombre de archivo
fr: Nom de fichier
pt: Nome do ficheiro

# FilterOperation_Contains
source: contains
de: enthält
es: contiene
fr: Contient
pt: contém

# FilterOperation_DistinctTo
source: distinct to
de: distinct
es: distinto de
fr: Distinct de
pt: diferente de

# FilterOperation_EndsWith
source: ends with
de: endet mit
es: acaba por
fr: Termine avec
pt: termina com

# FilterOperation_EqualTo
source: equal to
de: gleich
es: igual a
fr: Egal à
pt: igual a

# FilterOperation_GreaterThan
source: greater than
de: größer als
es: mayor que
fr: Plus grand que
pt: maior que

# FilterOperation_GreaterThanOrEqual
source: greater than or equal
de: größer als oder gleich
es: mayor o igual que
fr: Plus grand que ou égal
pt: maior ou igual a

# FilterOperation_LessThan
source: less than
de: weniger als
es: menor que
fr: Plus petit que
pt: menor que

# FilterOperation_LessThanOrEqual
source: less than or equal
de: kleiner oder gleich
es: menor o igual que
fr: Plus petit que ou égal
pt: menor ou igual a

# FilterOperation_StartsWith
source: starts with
de: beginnt mit
es: empieza por
fr: Débute avec
pt: começa por

source: have {0} decimals
de: haben Sie {0} decimal
es: tener {0} decimales
fr: A {0} décimales
pt: tem {0} casas decimais

source: have a number of elements {0} {1}
de: haben Sie eine Reihe von Elementen {0} {1}
es: tiene un número de elementos {0} {1}
fr: A nombre d'éléments{0} {1}
pt: tem um número de elementos {0} {1}

source: have a precision of
de: haben Sie eine Genauigkeit von
es: tener una precisión de
fr: A une précision
pt: tem uma precisão de

source: have between {0} and {1} characters
de: zwischen Sie {0} und {1} Zeichen
es: tener entre {0} y {1} caracteres
fr: A entre {0} et {1} caractère
pt: têm entre {0} e {1} caracteres

source: have maximun {0} characters
de: Maximun {0} Zeichen haben
es: tener máximo {0} caracteres
fr: A maximum {0}caractères
pt: tem máximo {0} caracteres

source: have minimum {0} characters
de: haben Sie mindestens {0} Zeichen
es: tener mínimo {0} caracteres
fr: A minimum {0} caractères
pt: tem mínimo {0} caracteres

source: have no repeated elements
de: haben Sie keine wiederholte Elemente
es: no debe tener elementos repetidos
fr: N'a pas d'éléments répétés
pt: não tem elementos repetidos

# HaveValid0Format
source: have a valid {0} format
de: haben Sie eine gültige {0}-format
es: debe tener un formato {0} válido
fr: A un format {0} valide
pt: tem formato {0} válido

source: Hour
de: Zeit
es: Hora
fr: Heur
pt: Hora

# IdentifiableEntity_ToStr
source: [Text]
es: [Texto]
fr: [Texte]
pt: [Texto]

# LockedModificationException
source: Modification not allowed: the object is locked
es: Modificación no permitida: el objeto está bloqueado
fr: Modifications pas acceptées: l'objet est vérouillé

source: Millisecond
de: Millisekunde
es: Milisegundo
fr: Milliseconde
pt: Milissegundo

source: Minute
es: Minuto
pt: Minuto

source: Month
de: Monat
es: Mes
fr: Mois
pt: Mês

source: New
de: Neu
es: Nuevo
fr: Nouveau
pt: Novo

source: New entities are not allowed
es: No se puede establecer una entidad nueva
fr: Les nouvelles entités sont interdites

source: of
de: der
es: de
fr: de
pt: de

# OnlyOneArgumentAllowed
source: Only extension methods of one argument are allowed
es: Debe tratarse de un metodo extensional de un solo argumento
fr: Seul des méthodes d'extension d'un argument sont accéptées

source: or be null
de: oder null sein
es: o ser nulo
fr: ou doit être nul
pt: ou é nulo

source: Property {0} has no value
es: La propiedad {0} no tiene un valor
fr: Propriété {0} n'a pas de valeur

source: property should be an expression accessing a property
es: property debe ser una expression de acceso a una propiedad

# RemovingEntityNotAllowedInNewLazies
source: Removing entity from a new lite is not allowed
es: No se puede eliminar la entidad a un Lite sin id
fr: Effacer les entités d'un nouveau Lite n'est pas accépté

source: Second
de: Sekunde
es: Segundo
fr: Seconde
pt: Segundo

source: Telephone
de: Telefon
es: Teléfono
pt: Telefone

source: The lenght of {{0}} has to be equal to {0}
de: Die Länge von {{0}} hat gleich {0} sein
es: La longitud de {{0}} ha de ser {0}
fr: La longueur de {{0}} doit être égal à {0}
pt: O comprimento de {{0}} deve ser igual a {0}

# TheLengthOf0HasToBeGreaterOrEqualTo0
source: The length of {{0}} has to be greater than or equal to {0}
de: Die Länge von {{0}} muss größer als oder gleich {0}
es: La longitud de {{0}} ha de ser mayor o igual a {0}
fr: La longueur de{{0}} doit être plus grand ou égal à{0}
pt: O comprimento de {{0}} deve ser maior ou igual a {0}

# TheLengthOf0HasToBeLesserOrEqualTo0
source: The length of {{0}} has to be less than or equal to {0}
de: Die Länge von {{0}} muss kleiner als oder gleich {0} sein
es: La longitud de {{0}} ha de ser menor o igual a {0}
fr: La longueur de {{0}} doit être moins ou égal à {0}
pt: O comprimento de {{0}} deve ser menor ou igual a {0}

source: The Lite {0} is not loaded, use Database.Retrieve or consider rewriting your query
es: El Lite {0} no está cargado, usa Database.Retrieve o considera reescribir tu query
fr: Le Lite {0} n'est pas chargé, utilisé la base de donné. Retirez ou reformulez votre recherche

source: The lite is pointing to a new entity and has no id yet
es: El Lite apunta a una entidad nueva que aún no tiene Id
fr: Le Lite pointe une nouvelle entité et n'a pas d'id encore

source: The number of elements of {{0}} has to be {0} {1}
de: Die Anzahl der Elemente von {{0}} hat zu {0} {1} werden
es: El número de elementos en {{0}} ha de ser {0} {1}
fr: Le nombre d'éléments de {{0}} doit être de {0} {1}
pt: O número de elementos de {{0}} deve ser {0} {1}

source: ToLiteLight not allowed for new entities
es: Sólo se permite ToLiteLight para Entidades con Id
fr: ToLiteLight n'est pas accepté pour les nouvelles entités

# Type0NotSupported
source: Type {0} is not supported
es: Tipo no soportado {0}
fr: Type {0} n'est pas supporté

# TypeIsNotSmallerThan
source: Type {0} is not smaller than {1}
es: El tipo {0} no es menor que {1}
fr: Type {0} n'est pas plus petit que {1}

source: Year
de: Jahr
es: Año
fr: Année
pt: Ano

source: As {0}
de: Als {0}
fr: Comme {0}
pt: Como {0}

# FilterOperation_Like
source: like
de: wie
pt: como
