Repository: 2moveit/framework
Catalog: Signum.Utilities/Properties/Resources.*.resx
Languages: es

source: Cube not found
es: Cubo no encontrado

source: Empty Priority Queue
es: PriorityQueue vacía

source: Key {0} not found
es: Key {0} no encontrada

source: Empty stack
es: ImmutableStack vacío

source: Empty queue
es: ImmutableQueue vacía

source: Empty tree
es: ImmutableAVLTree vacío

source: Cannot remove item that is not in tree.
es: Imposible eliminar un elemento que no está en el arbol.

source: min and max should be greater than 0
es: min y max deben ser mayores que 0

source: max should be greater or equal than min
es: max debe ser mayor o igual a min

# InconsistenceFoundCube012CouldHaveValues34
source: Inconsistence found, cube {0} x {1} x {2} could have values {3} ó {4}
es: Inconsistencia encontrada, el cubo {0} x {1} x {2} podria contener los valores {3} ó {4}

source: Min is greater than Max
es: min es mayor que max

# Intervalo0OverlapsWithExistingOne1Value2
source: Interval {0} overlaps with the existing {1}, value : {2}
es: El intervalo {0} solapa con el ya existente {1}, valor: {2}

# Interval0OverlapsWithTheExisting1
source: Interval {0} overlaps with the exisisting {1}
es: El intervalo {0} solapa con el ya existente {1}

source: Dictionary Empty
es: Diccionario Vacío

source: No interval found
es: No existe un intervalo

# IntervalLimitsDoNotExistOnDictionary
source: Interval limits do not exisit on dictionary
es: Los limites del intervalo han de existir exactamente en el diccionario

# InconsistenceFoundOnSquare01CouldHaveValues23
source: Inconsistence found, square {0} x {1} could have values {2} ó {3}
es: Inconsistencia encontrada, el cuadrado {0} x {1} podria contener los valores {2} ó {3}

source: The node {0} is not in the graph
es: El nodo {0} no está en el grafo

source: Empty List
es: Lista vacía

source: No match in a {0} -> {1} switch
es: Ningún patrón encaja en switch {0} -> {1}

# NoMemberNamed0
source: There is no member with name '{0}'
es: No existe ningún miembro llamado '{0}'

# MoreThanOneMemberNamed0
source: There is more than one member named '{0}'
es: Existen más de un miembro llamado '{0}'

# _0HasNoFreeBits
source: {0:X} has no free bits
es: {0:X} no tiene potencias de dos libres

# CellStartsByQuotesButNotEndsLikeThis
source: Cell starts by " but do not ends like this : {0}
es: La celda empieza por " pero no acaba con ": {0}

# CellHasQuotesInAnUnexpectedPosition
source: Cell has " in an unexpected position: {0}
es: La celda contiene " en una posición inesperada: {0}

# SecondCollectionsIsShorter
source: The second collection is shorter
es: La segunda colección es más pequeña

# FirstCollectionIsShorter
source: The first collecton is shorter
es: La primera colección es más pequeña

source: String '{0}' is too short
es: La cadena '{0}' es demasiado corta

# IsNotAnEnum
source: {0} is not an Enum
es: {0} no es un enum

source: No element exist with key: {0}
es: No existe ningún elemento con clave: {0}

source: There is more than one element with key: {0}
es: Existen más de un elemento con clave: {0}

# _0Year1Month2Day
source: {0} Year(s), {1} Month(s), {2} Day(s)
es: {0} Año(s), {1} Mes(es), {2} Día(s)

source: Error {0}: Lacking: {1} Extra: {2}
es: Error {0}: Faltan: {1} Sobran: {2}

# TheDateHasSomeValueInTheHourMinuteSecondOrMillisecond
source: The date has some value in the hour, minutes, seconds or milliseconds
es: La fecha tiene algún valor asignado en las horas, los minutos, los segundos o los milisegundos

source: Unhandled binding type '{0}'
es: Tipo de binding no tratado '{0}'

source: Unhandled expression type: '{0}'
es: Tipo de expresion no tratado '{0}'

source: {0} Day
es: {0} día

source: {0} Days
es: {0} días

source: {0} Month
es: {0} mes

source: {0} Months
es: {0} meses

source: {0} Year
es: {0} año

source: {0} Years
es: {0} años
