Repository: 2moveit/framework
Catalog: Signum.Engine/Properties/Resources.*.resx
Languages: es

source: '{0}' has been renamed in {1}?
es: ¿Se ha renombrado '{0}' en {1}?

# _0ObjectsInsertedButOnly1IdsAreGenerated
source: {0} objects inserted but only {1} ids have been generated
es: Se han insertado {0} objetos pero solo se han generado {1} ids

source: {0} repeated on table {1}
es: {0} repetido en la tabla {1}

source: Access to Query '{0}' is not allowed
es: El acceso a la Query '{0}' no está permitido

source: At less one nullable field must be passed
es: Como mínimo debe pasarse un campo nulable

# BelongsToAnotherKindOkLinqProvider
source: {0} belongs to another kind ok Linq Provider
es: {0} peretenece a otro tipo de Linq Provider

source: caching types' table from {0}
es: cacheando la tabla de tipos desde {0}

# CanNotBeAssignedFrom1
source: {0} can not be assigned from {1}
es: {0} no puede ser asignado desde {1}

# CanNotBeAssignedToNull
source: {0} can not be assigned to null
es: {0} no puede ser establecido a nulo

source: Cannot enumerate more than once
es: No se puede enumerar más de una vez

source: Cannot insert duplicated fields {0} on {1} table
es: No se pueden insertar duplicados en el campo {0} de la tabla {1}

source: Concurrency error on database, Table = {0}, Id = {1}
es: Error de concurrencia en la base de datos, Tabla = {0}, Id = {1}

# ConstantExpressionWithAComplexIQueryableUnexpectedAt
source: ConstantExpression with a complex IQueryable unexpected at this stage
es: ConstantExpression con un IQueryable complejo no esperado en este punto

# DoesNotImplement1
source: {0} does not implement {1}
es: {0} no implementa {1}

# DoesNotInheritFromEmbeddedEntity
source: {0} does not inherit from EmbeddedEntity
es: {0} no hereda de EmbeddedEntity

# DoesNotRepresentAColumn
source: {0} does not represent a column
es: {0} no representa una columna

source: --- END OF SYNC SCRIPT
es: --- FIN DEL SCRIPT DE SINCRONIZACION

source: Entity column not found
es: Columna de entidad no encontrada

source: EntityIn not defined for new Item of type {0}
es: EntityIn no definido para el nuevo elemento del tipo {0}

source: Entity of type {0} and Id {1} not found
es: No se ha encontrado la entidad de tipo {0} e Id {1}

source: Entity with type {0} and Id {1} not found
es: No se han encontrado {0} con Id {1}

source: Error {0}: N + 1 query problem
es: Error {0}: probelma en la query de N + 1

source: Exception on {0}: {1}
es: Excepción en {0}: {1}

source: expression Type is not IQueryable
es: la expresión Type no está en el IQueryable

# Field0ContainsBoth1And2
source: Field {0} contains both a {1} as a {2}
es: El campo {0} contiene tanto un atributo {1} como uno {2}

# Field0HasNullAndOsNotNullable
source: Field {0} has a null value but is not nullable
es: El campo {0} tiene una valor nulo y no es nullable

# Field0NotInType1
source: Field {0} not found on type {1}
es: El campo {0} no se encuentra en el tipo {1}

# Field0OfTipe1HasNoCompatibleProperty
source: <=!=> The field {0} of type {1} has not corresponding property
es: <=!=> El Campo {0} del tipo {1} no tiene una propiedad compatible

source: Field {0} of type {1} has no database representation
es: El campo {0} de la clase {1} no tiene una manera de representarse en la base de datos

# Field0OfType1ShouldBeMappedAs2ButItIsIncompatibleWithContext3
source: Field {0} of type {1} shuld be mapped as {2} but is incompatible with context {3}
es: El campo {0} de la clase {1} deberia ser mapeado como un {2} pero es incompatible en un contexto {3}

source: FieldInitExpression bindings should be empty
es: FieldInitExpression binding debe estar vacío

source: Fields {0} are set at the same time
es: Los campos {0} están establecidos al mismo tiempo

source: hasValue should be a bool expression
es: hasValue debería ser una expresión booleana

source: ImplementedByAll {0} = {1} but {2} = {3}
es: ImplementedByAll {0} = {1} pero {2} = {3}

source: ImplementedByAll is not supported for FindLiteLike
es: ImplementedByAll no está soportado par FindLiteLike

source: ImplementedByAll is not supported for RetriveAllLite
es: ImplementedByAll no está soportado para RetriveAllLite

source: Impossible to convert the value of {0}.{1} ({2}) to {3}
es: Imposible convertir el valor de {0}.{1} ({2}) a {3}

source: Impossible to include in the Schema:
es: Imposible incluir en el Schema:

# ImpossibleToSaveNullOnANotNullableEmbeddedFieldUseNullable
source: Impossible to save null on a not-nullable embedded field, use Nullable Attribute over the field
es: Imposible guardar null en un campo embebido no nulable, utilice Nullable Attribute sobre el campo

# IsNewButHasId1AndIdentityIsTrue
source: {0} is New, but has Id ({1}) and Identity is true
es: {0} es nuevo, pero tiene Id ({1}) e Identity es true

source: MemberInfo {0} not supported by CollectionField
es: El MemberInfo {0} no está soportado por CampoColeccion

source: MList on ImplementedBy are not supported yet
es: Los MList en ImplementedBy no están soportados aún

source: More than one Entity column
es: Más de un Entity column

# MsInitializing0
source: {1:0.00} ms initializing {0}
es: {1:0.00} ms inicializando {0}

source: Multiple Index on the following Columns:
es: Índices múltiples en las siguientes columnas:

source: - n: None
es: - n: Ninguno

source: No Current Connection established. Use ConnectionScope.Default to do it
es: No se ha establecido ninguna conexión actual. Utiliza ConnectionScope.Default para hacerlo

source: No EntityCache context has been created
es: No se ha creado un contexto de EntityCache

source: No field was given
es: No se ha proporcionado ningún campo

source: No implementation for type(s) {0}
es: No existe implementación para el/los tipo/s {0}

# NoNameForField0Defined
source: No name for field {0} is defined
es: No está definido el nombre para {0} en este caso

# NoNameForType0Defined
source: No name for type {0} is defined
es: No está definido el nombre para {0} en este caso

# NoStackFoundForThisKey
source: There is no stack for this key
es: No hay una pila para esta clave

# NotAllEntitiesOfType0AndIds1Removed
source: Not all entities of type {0} and ids {1} are removed
es: No se han eliminado todas las entidades de tipo {0} e ids: {1}

source: No way of mapping type {0} found
es: No se ha encontrado manera de mapear el tipo {0}

source: Reference to undefined column
es: Referencia a columna no definida

source: Set operations are not allowed on queries with Non-Single Cell projections
es: Operaciones de conjuntos no están permitidas en consultas de más de una celda

source: --- START OF SYNC SCRIPT GENERATED ON {0}
es: --- INICIO DEL SCRIPT DE SINCRONIZACION GENERADO EL {0}

source: subquery with {0} columns!
es: ¡subquery con {0} columnas!

# Table0NotLoadedInSchema
source: Table for type {0} not loaded on current Schema
es: La tabla para el tipo {0} no está cargada en el Esquema actual

# TableForType0NotInSchema
source: Table for type {0} not loaded on current Schema
es: No se ha encontrado la tabla para el tipo {0} en el Esquema

source: Testing sql conditioness for non boolean expression: {0}
es: Probando condiciones sql para expresiones no booleanas: {0}

source: The binary operator '{0}' is not supported
es: El operador binario '{0}' no está soportado

source: The constant for '{0}' is not supported
es: La constante '{0}' no está soportada

source: The entity is New
es: La entidad es nueva

source: The expression can't be translated to SQL:
es: La expresión no se puede traducir a SQL:

source: The field {0} is not included
es: El campo {0} no está incluido

source: The field has no implementation for type {0}
es: El campo no tiene una implementación para el tipo {0}

source: The following attributes are not compatible with Targets {0}: {1}
es: Los siguientes atributos no son compatibles con Targets {0}: {1}

source: The member {0} of {1} is no accesible on queries
es: El miembro {0} de {1} no es accesible en queries

source: The member {0} of ImplementedByAll is no accesible on queries
es: El miembro {0} de ImplementedByAll no es accesible en queries

source: The member {0} of Lite is no accesible on queries, use Entity instead
es: El miembro {0} de Lite no es accesible en queries, utilice Entity en su lugar

# TheProperty0ForType1IsnotFound
source: Property {0} for type {1} not found
es: No se ha encontrado la propiedad {0} para el tipo {1}

source: There are '{0}' that refer this entity
es: Hay '{0}' que refieren a esta entidad

source: There are entities of different types
es: Hay entidades de diferentes tipos

source: There are more than one Entity column
es: Hay más de un Entity column

source: There are records in '{0}' pointing to this table by column '{1}'
es: Hay registros en '{0}' que refieren a esta tabla por la columna '{1}'

# ThereIsASqlPreComandSimpleWithMoreThan0Parameters
source: There is a SqlPreCommandSimple with more than {0} parameters
es: Existe un SqlPreCommandSimple con más de {0} parámetros

source: There is no Entity column
es: No hay Entity column

source: There must be more than one field passed for the MultiColumnTrigger
es: Debe pasarse más de un campo al MultiColumnTrigger

# TheTransactionIsRolledBack
source: The transaction is rolled back (a previous transaction has not been confirmed)
es: Se ha hecho Rollback de la transacción (un Transaction previo no se ha confirmado)

source: The type {0} is not in the Types Table
es: El tipo {0} no está en la tabla de tipos

source: The type {0} is not the Lite version of {1}
es: El tipo {0} no es la versiona Lite de {1}

source: The unary operator '{0}' is not supported
es: El operador unario '{0}' no está soportado

# TheView0IsNotOnQueryManager
source: View {0} is not in the QueryManager
es: La vista {0} no ha sido dada de alta en el QueryManager

source: ToStr is no accesible on queries in ImplementedByAll
es: ToStr no es accesible en queries en ImplementedByAll

source: TRANSACTION ROLLBACKED!
es: ¡Se ha hecho un ROLLBACK!

source: Type {0} contains both {1} and {2}
es: El tipo {0} contiene tanto un atributo {1} como uno {2}

source: Type {0} is abstract
es: El tipo {0} es abstract

# Type0IsNotAMappedType1
source: Type {0} is not any of Mapped types : {1}
es: El tipo {0} no es de ninguno de los tipos mapeados: {1}

# Type0IsNotAnIdentifiableEntityOrAnEnum
source: Type {0} is not an Entity neither an Enum
es: El tipo {0} no es una Entidad ni un enumerado

source: Type {0} is not in {1}
es: El tipo {0} no está en {1}

source: Type {0} not found in the Schema
es: El tipo {0} no se encuentra en el esquema

# TypeDNTableNotCached
source: TypeDN table not cached. Remember to call TypeLogic.Start in your Starter and call Administrator.InitializeCurrentSchema
es: Tabla TypeDN no cacheada. Recuerda llamar a TypeLogic.Start en tu Starter y llamar a Administrator.InitializeCurrentSchema

source: Type of Expression is {0} but type of field is {1}
es: El tipo de la expresion es {0} pero el del campo es {1}

# Types0DoNotImplement1
source: The types {0} do not implement {1}
es: Los tipos {0} no implementan {1}

source: Unauthorized access to {0}
es: Acceso denegado a {0}

# UniqueMultiNullsWorksWithOnlyOneFieldUseAdministrator
source: UniqueMultiNulls works with only one field. Use Administrator.AddMultiColumnUniqueTriggerNullable instead.
es: UniqueMultiNulls trabaja sólo con un campo. Utilice Administrator.AddMultiColumnUniqueTriggerNullable en su lugar.

source: UserConnections file found on {0}
es: Archivo de conexiones de usuario encontrado en {0}

source: Warning {0}: No results
es: Advertencia {0}: No hay resultados

source: Entity must be a Lite
es: Entity debe ser un Lite

source: PropertyRoute can not be of type Root
es: PropertyRoute no puede ser del tipo Root

source: The type of column {0} is a subtype of IIdentifiable, use a Lite instead!!
es: El tipo de columna {0} es un subtipo de IIdentifiable, utilice un Lite en su lugar
